hx_sweep/LN2_3bar_Re500/system/blockMeshDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object blockMeshDict;
}
convertToMeters 1;

vertices
(
    (0 0 0) // 0
    (0.3 0 0) // 1
    (0.3 0.01 0) // 2
    (0 0.01 0) // 3
    (0 0 0.01) // 4
    (0.3 0 0.01) // 5
    (0.3 0.01 0.01) // 6
    (0 0.01 0.01) // 7
    (0 0.018 0) // 8
    (0.3 0.018 0) // 9
    (0.3 0.028 0) // 10
    (0 0.028 0) // 11
    (0 0.018 0.01) // 12
    (0.3 0.018 0.01) // 13
    (0.3 0.028 0.01) // 14
    (0 0.028 0.01) // 15
    (0 0.036 0) // 16
    (0.3 0.036 0) // 17
    (0.3 0.046 0) // 18
    (0 0.046 0) // 19
    (0 0.036 0.01) // 20
    (0.3 0.036 0.01) // 21
    (0.3 0.046 0.01) // 22
    (0 0.046 0.01) // 23
    (0 0.054 0) // 24
    (0.3 0.054 0) // 25
    (0.3 0.064 0) // 26
    (0 0.064 0) // 27
    (0 0.054 0.01) // 28
    (0.3 0.054 0.01) // 29
    (0.3 0.064 0.01) // 30
    (0 0.064 0.01) // 31
    (0 0.072 0) // 32
    (0.3 0.072 0) // 33
    (0.3 0.082 0) // 34
    (0 0.082 0) // 35
    (0 0.072 0.01) // 36
    (0.3 0.072 0.01) // 37
    (0.3 0.082 0.01) // 38
    (0 0.082 0.01) // 39
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (180 18 18) simpleGrading (1 ((0.5 0.5 6)(0.5 0.5 0.166667)) ((0.5 0.5 6)(0.5 0.5 0.166667))) // channel1
    hex (8 9 10 11 12 13 14 15) (180 18 18) simpleGrading (1 ((0.5 0.5 6)(0.5 0.5 0.166667)) ((0.5 0.5 6)(0.5 0.5 0.166667))) // channel2
    hex (16 17 18 19 20 21 22 23) (180 18 18) simpleGrading (1 ((0.5 0.5 6)(0.5 0.5 0.166667)) ((0.5 0.5 6)(0.5 0.5 0.166667))) // channel3
    hex (24 25 26 27 28 29 30 31) (180 18 18) simpleGrading (1 ((0.5 0.5 6)(0.5 0.5 0.166667)) ((0.5 0.5 6)(0.5 0.5 0.166667))) // channel4
    hex (32 33 34 35 36 37 38 39) (180 18 18) simpleGrading (1 ((0.5 0.5 6)(0.5 0.5 0.166667)) ((0.5 0.5 6)(0.5 0.5 0.166667))) // channel5
);

edges ();

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
            (8 11 15 12)
            (16 19 23 20)
            (24 27 31 28)
            (32 35 39 36)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
            (9 10 14 13)
            (17 18 22 21)
            (25 26 30 29)
            (33 34 38 37)
        );
    }
    heatedWall
    {
        type wall;
        faces
        (
            (0 1 2 3)
            (8 9 10 11)
            (16 17 18 19)
            (24 25 26 27)
            (32 33 34 35)
        );
    }
);

defaultPatch
{
    name adiabaticWalls;
    type wall;
}

mergePatchPairs ();
